Training_set_generation/scripts/reference_configs/simpleFoam_MRF_propeller_komegasst_combined/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// libs            (petscFoam);

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   1; // 1000

purgeWrite      2;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // #include "FOs/FOforceCoeffs"
    #include "FOs/FOyPlus"
    #include "FOs/FOfieldAverage"
    // #include "FOs/FOwallShearStress"
    #include "FOs/FOforces"
    // #include "FOs/FOsurfaceFieldValue"
    // #include "FOs/FOsurfaceDistance"
    // #include "FOs/FOnearWallFields"
}


// ************************************************************************* //
