Training_set_generation/scripts/reference_configs/simpleFoam_MRF_propeller_komegasst_combined/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*x_min,x_max
(-42323.22, 63771.617)
y_min,y_max
(-31464.690000000002, 31464.690000000002)
z_min,z_max
(-318.469, 20160.864999999998)
*/ 

scale   1;

vertices
(
    (-2 -2 -2)
    ( 2 -2  -2)
    ( 2  1  -2)
    (-2  1  -2)
    (-2 -2 2)
    ( 2 -2 2)
    ( 2  1 2)
    (-2  1 2)
  //  (0 -2 -2)
    // (0 1  -2)   
   // (0 -2 2)
    //(0 1  2)       
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (51 41 51) simpleGrading (1 1 1)
   // hex (0 8 9 3 4 10 11 7) (25 50 41) simpleGrading (1 1 1)
    // hex (8 1 2 9 10 5 6 11) (25 25 41) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // outlet
    inlet
    {
        type patch;
        faces
        (
             (3 7 6 2)
           //  (3 7 11 9)
           // (9 11 6 2)
        );
    }
  
    // inlet
    outlet
    {
    	type patch;
	faces
	(
             (1 5 4 0)
            //(1 5 10 8)
           // (8 10 4 0)
        );
    }   
   
          
    
);


// ************************************************************************* //
