Training_set_generation/scripts/reference_configs/simpleFoam_MRF_propeller_komegasst_combined/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

	/*
    outlet
    {
        type            fixedValue;
        value           uniform (0 -5 0);
        // value           $internalField;
    }
    */
    
    outlet
    {
        type            zeroGradient;
    }
    


    ExteriorCylinder
    {
        type            fixedValue;
        // inletValue      uniform (0 0 0);
        value           $internalField; // (0 -5 0);
    }
    
    propeller
    {
        type            noSlip;
    }
          
    
    // #include "include/frontBackUpperPatches"
}


