Training_set_generation/scripts/reference_configs/simpleFoam_MRF_propeller_komegasst_combined/0_org/include/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

top
{
    type slip;
}

left
{
    type slip;
}

right
{
    type slip;
}
// ************************************************************************* //
