Training_set_generation/scripts/reference_configs/simpleFoam_MRF_propeller_komegasst_combined/0_org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (0 -4.96 0);
pressure             0;
turbulentKE          0.24;
turbulentOmega       1.78;

// ************************************************************************* //
