Training_set_generation/scripts/reference_configs/simpleFoam_MRF_propeller_komegasst_combined/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"


    inlet
    {
        type            calculated;
        value           uniform 0;
    }

/*
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
 */
 
     outlet
    {
        type            zeroGradient;
    } 
 

    ExteriorCylinder
    {
        type            calculated;
        value           uniform 0;
    }

    propeller
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
}


// ************************************************************************* //
