Training_set_generation/scripts/reference_configs/simpleFoam_MRF_propeller_komegasst_combined/0_org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

	/*
    outlet
    {
        type            fixedValue;
        // inletValue      $internalField;
        value           $internalField;
    }
    */
    
    outlet
    {
        type            zeroGradient;
    }    
  
    
    ExteriorCylinder
    {
        type            fixedValue;
        // inletValue      $internalField;
        value           $internalField;
    }    

    propeller
    {
        type            omegaWallFunction;
        value           $internalField;
    }
       
    
    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
