Training_set_generation/scripts/reference_configs/simpleFoam_MRF_propeller_komegasst_combined/system/meshQualityDict_layering
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Include defaults parameters from master dictionary
// #includeEtc "caseDicts/meshQualityDict"


maxNonOrtho             180;

maxBoundarySkewness     -1;

maxInternalSkewness     -1;

maxConcave              180;

minVol                  1e-30;

minArea                 -1;

minTwist                -1;

minDeterminant          -1;

minTetQuality            1e-30;

minFaceWeight           -1;

minVolRatio             -1;

minTriangleTwist        -1;

nSmoothScale            4;

errorReduction          0.75;

relaxed
{
    maxNonOrtho             180;
}




// ************************************************************************* //
