Training_set_generation/scripts/reference_configs/simpleFoam_MRF_propeller_komegasst_combined/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // actuationDisk1
    {
        name    propellerVolumeCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-1.75 -0.75 -1.75) (1.75 0.75 1.75);
    }
    {
        name    propellerVolume;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     propellerVolumeCellSet;
    }


);


// ************************************************************************* //
